# GetWSImageScaleF

## Description
Returns the scale factor of the specified worksheet on drawing object.

```pascal
FUNCTION GetWSImageScaleF(handle : HANDLE) : REAL;
```

```python

def vs.GetWSImageScaleF(handle):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE|The handle to the worksheet on drawing object.|

## Returns
The scale factor of the specified worksheet on drawing object.

## Version
Availability: from Vectorworks 2017
## Category
* Worksheets